'use strict';

var dbm;
var type;
var seed;

/**
  * We receive the dbmigrate dependency from dbmigrate initially.
  * This enables us to not have to rely on NODE_PATH.
  */
exports.setup = function (options, seedLink) {
  dbm = options.dbmigrate;
  type = dbm.dataType;
  seed = seedLink;
};

const sqlUp = `
CREATE TABLE test(
	vacancy varchar(256),
	"type" varchar(50),
	description varchar(1024)
);

INSERT INTO test
VALUES
	('Водій автонавантажувач', 'Requirements', 'Повна або базова загальна середня освіта.'),
	('Водій автонавантажувач', 'Requirements', 'Професійно-технічна освіта.'),
	('Водій автонавантажувач', 'Requirements', 'Підвищення кваліфікації і стаж роботи за професією водія навантажувача не менше 1 року.'),
	('Водій автонавантажувач', 'Requirements', 'Наявність посвідчення водія навантажувача.'),
	('Водій автонавантажувач', 'Responsibilities', 'Управління  навантажувачем, спеціальними  вантажопідйомними механізмами  і  пристосуваннями при  завантаженні,  розвантаженні, переміщенні і штабелюванні різних вантажів.'),
	('Водій автонавантажувач', 'Responsibilities', 'Визначення  несправностей  в роботі  навантажувача  та його механізмів.'),
	('Водій автонавантажувач', 'Responsibilities', 'Забезпечення  якісного і належного  виконання  складських операцій з матеріальними цінностями (завантаження, вивантаження, переміщення, розміщення на стелажах), які зберігаються на складах.'),
	('Водій автонавантажувач', 'Responsibilities', 'Забезпечення виконання комплексу складських робіт із застосуванням  терміналів (сканерів) з дотриманням існуючих  нормативів, виробничих завдань та вимог.'),
	('Ліфтер', 'Requirements', 'Повна або базова загальна середня освіта. Професійно-технічна освіта.'),
	('Ліфтер', 'Requirements', 'Одержання професії та посвідчення  через курси виробничо-технічного навчання.'),
	('Ліфтер', 'Requirements', 'Посвідчення за професією ліфтера.'),
	('Ліфтер', 'Responsibilities', 'Забезпечення безпечної, безперебійної та безаварійної експлуатації ліфта з дотриманням   вимог правил експлуатації.'),
	('Ліфтер', 'Responsibilities', 'Запуск ліфта в роботу з попередньою перевіркою справності: аварійної сигналізації, дієвості кнопки “Стоп”, світлової і звукової сигналізації, автоматичних замків, електронної завіси кабіни ліфта, рівня масла в гідростанції ліфта, роботи гідравлічних клапанів руху кабіни, сенсорних кнопок управління кабіни, переговорних пристроїв, тощо.'),
	('Ліфтер', 'Responsibilities', 'Вчасна та якісна доставка товарно–матеріальних цінностей (сировини, матеріалів, напівфабрикатів і т.д.) з дотриманням встановлених вимог. Забезпечення їх завантаження з рампи у ліфт та вивантаження на площадку виробничого підрозділу. Переміщення вантажів між поверхами, доставка до конкретного місця призначення.'),
	('Машиніст розфасувального-пакувальних машин', 'Requirements', 'Повна або базова загальна середня освіта.'),
	('Машиніст розфасувального-пакувальних машин', 'Requirements', 'Професійно-технічна освіта або одержання професії безпосередньо на виробництві, підвищення кваліфікації.'),
	('Машиніст розфасувального-пакувальних машин', 'Responsibilities', 'Ведення процесу загортання, розфасування та укладання  кондвиробів за заданим об’ємом, кількістю, видом на розфасувально-пакувальних машинах. Пуск і зупинка машини.'),
	('Машиніст розфасувального-пакувальних машин', 'Responsibilities', 'Обслуговування розфасувально-пакувальних машин. Заправлення машини загортальними матеріалами ( етикетка). Контроль за безперебійною роботою машини і якістю загортки. Усунення обриву загортальних матеріалів.'),
	('Машиніст розфасувального-пакувальних машин', 'Responsibilities', 'Відбір неякісної продукції.'),
	('Машиніст розфасувального-пакувальних машин', 'Responsibilities', 'Заповнення електронної та/або паперової версії карт контролю якості з QMS по якості загортки і звільненню напівфабрикату. Звітування про використання  готової продукції та пакувальних матеріалів з використанням сканеру (RF).'),
	('Машиніст розфасувального-пакувальних машин', 'Responsibilities', 'Регулювання швидкості машини. Здійснення дрібного поточного ремонту машини, її змащення, миття.'),
	('Налагоджувальник устаткування у виробництві харчової продукції', 'Requirements', 'Середня або середньо-технічна освіта, курси підвищення кваліфікації.'),
	('Налагоджувальник устаткування у виробництві харчової продукції', 'Requirements', 'Вміння працювати в команді.'),	
	('Налагоджувальник устаткування у виробництві харчової продукції', 'Requirements', 'Ініціативність.'),
	('Налагоджувальник устаткування у виробництві харчової продукції', 'Requirements', 'Уважність до деталей.'),
	('Налагоджувальник устаткування у виробництві харчової продукції', 'Responsibilities', 'Проведення налагодження ліній на програмному рівні. Перевірку стану  взаємодії всіх вузлів устаткування, усунення асинхронності в роботі устаткування. Участь у виконанні різних видів ремонту, випробуванні устаткування і передачі в експлуатацію.'),	
	('Налагоджувальник устаткування у виробництві харчової продукції', 'Responsibilities', 'Попередження, виявлення та усунення технічних несправностей у роботі устаткування.'),
	('Налагоджувальник устаткування у виробництві харчової продукції', 'Responsibilities', 'Регулювання вузлів, механізмів та електронних приладів в процесі роботи.'),
	('Приймальник-здавальник', 'Requirements', 'Повна або базова загальна середня освіта. Професійно-технічна освіта.'),	
	('Приймальник-здавальник', 'Requirements', 'Одержання професії безпосередньо на виробництві, підвищення кваліфікації.'),
	('Приймальник-здавальник', 'Responsibilities', 'Приймає  сировину та допоміжні матеріали із складу.'),
	('Приймальник-здавальник', 'Responsibilities', 'Здає  готову продукцію на склад.'),
	('Приймальник-здавальник', 'Responsibilities', 'Перевіряє кількість, вагу, правильність маркування та статусу, терміну придатності до споживання продукції  і її  відповідність супроводжуючим документам.'),
	('Приймальник-здавальник', 'Responsibilities', 'Підтверджує в системі SAP приймання продукції RF-сканером.'),
	('Приймальник-здавальник', 'Responsibilities', 'Підвозить та  відвозить сировину, допоміжні матеріали, напівфабрикати на дільниці, розміщує їх згідно вимог і схем зонування.'),
	('Приймальник-здавальник', 'Responsibilities', 'Відвозить порожню тару та палети, відсортовує некондиційну тару.'),
	('Слюсар-ремонтник', 'Requirements', 'Базова або середня спеціальна освіта. Стаж роботи за професією слюсаря – ремонтника 5р., не менше 1 року. Підвищення кваліфікації.'),
	('Слюсар-ремонтник', 'Requirements', 'Вміння працювати в команді.'),
	('Слюсар-ремонтник', 'Requirements', 'Ініціативність.'),
	('Слюсар-ремонтник', 'Requirements', 'Уважність до деталей.'),
	('Слюсар-ремонтник', 'Responsibilities', 'Ремонт та профілактичний огляд обладнання ПС і ХПКД, ремонт сантехнічного обладнання виробництва, офісів та виробничих приміщень.'),
	('Слюсар-ремонтник', 'Responsibilities', 'Капітальний і середній ремонт обладнання, розбирання, збирання, монтаж, випробування устаткування, вузлів, механізмів, силових установок, агрегатів та машин.'),
	('Слюсар-ремонтник', 'Responsibilities', 'Виявлення і усунення дефектів під час експлуатації обладнання і випробування його в процесі ремонту.'),
	('Слюсар-ремонтник', 'Responsibilities', 'Перевірка на точність та здача в експлуатацію відремонтованого обладнання.'),
	('Слюсар з контрольно-вимірювальних приладів', 'Requirements', 'Базова або середня спеціальна освіта.'),
	('Слюсар з контрольно-вимірювальних приладів', 'Requirements', 'Вміння працювати в команді.'),
	('Слюсар з контрольно-вимірювальних приладів', 'Requirements', 'Ініціативність.'),
	('Слюсар з контрольно-вимірювальних приладів', 'Requirements', 'Уважність до деталей.'),
	('Слюсар з контрольно-вимірювальних приладів', 'Responsibilities', 'Проведення монтажу, демонтажу, ремонту, випробування, перевірки, юстування та налагодження контрольно-вимірювальних приладів і автоматики (КВПіА): складні і точні засоби вимірювальної техніки та автоматичного регулювання, контролери; манометри самопишучі, контактні; автомати живлення, тиску і температури.'),
	('Слюсар з контрольно-вимірювальних приладів', 'Responsibilities', 'Перевірка на точність та здача в експлуатацію відремонтованого обладнання.'),
	('Транспортувальник', 'Requirements', 'Повна або базова загальна середня освіта.'),
	('Транспортувальник', 'Requirements', 'Професійно-технічна освіта або одержання професії безпосередньо на виробництві, підвищення кваліфікації.'),
	('Транспортувальник', 'Responsibilities', 'Переносить вручну, перевозить на роклах та інших транспортних засобах різні вантажі: сировину, допоміжні матеріали, напівфабрикати, готову продукцію тощо, згідно із змінним завданням.'),
	('Транспортувальник', 'Responsibilities', 'Укладає, сортує, зважує вантажі, що транспортуються (в т.ч. санітарні відходи).'),
	('Транспортувальник', 'Responsibilities', 'Зачищає обладнання, підготовляє необхідну сировину, напівфабрикати для виробництва згідно змінного завдання.'),
	('Транспортувальник', 'Responsibilities', 'Розпалетовує отриману сировину. Опалетовує готову продукцію на піддонах, наклеює лейби на готову продукцію. Підвозить до ліфта та здає на склад.'),
	('Транспортувальник', 'Responsibilities', 'Декларує готову продукцію чи напівфабрикати, підтверджує отримання сировини і допоміжних матеріалів зі складу в системі SAP з допомогою RF-сканера.'),
	('Транспортувальник', 'Responsibilities', 'Забезпечує належне зберігання та збереження товарно – матеріальних цінностей; ефективне використання виробничих площ.'),
	('Транспортувальник', 'Responsibilities', 'Контролює справність механізмів, якими управляє. Усуває дрібні несправності. Чистить їх та змащує.');


INSERT INTO job_vacancy_description_record(job_vacancy, "type", description)
SELECT jobVacancy."id", test."type", test.description
FROM jobVacancy
join test on test."vacancy" = jobVacancy."name";

DROP TABLE test;
`;

exports.up = function (db) {
  return db.runSql(sqlUp);
};


const sqlDown = `
DELETE FROM job_vacancy_description_record;
`;

exports.down = function (db) {
  return db.runSql(sqlDown);
};

exports._meta = {
  "version": 1
};
